

/*
数据竞争（data race）类似于竞态条件，它由这三个行为造成：

两个或更多指针同时访问同一数据。
至少有一个指针被用来写入数据。
没有同步数据访问的机制。

*/

/*
概括引用的用法：
在任意给定时间，要么 只能有一个可变引用，要么 只能有多个不可变引用。
引用必须总是有效的。
*/

fn main() {
    //可以使用大括号来创建一个新的作用域，以允许拥有多个可变引用，只是不能 同时 拥有
    {
        let mut s = String::from("hello");
        {
            let r1 = &mut s;
            println!("r1: {}", r1);
        } // r1 在这里离开了作用域，所以我们完全可以创建一个新的引用

        let r2 = &mut s;
        println!("r2: {}", r2);
    }
    //类似的规则也存在于同时使用可变与不可变引用中
    {
        let mut s = String::from("hello");

        //多个不可变引用是可以的,因为数据不会变，不影响操作
        let r1 = &s; // 没问题
        let r2 = &s; // 没问题
        //使用者可不希望不可变引用的值在他们的眼皮底下突然被改变了，一旦变了，则会报错
        // let r3 = &mut s; // 大问题
        
        //注意一个引用的作用域从声明的地方开始一直持续到最后一次使用为止
        println!("r1:{}, r2:{}", r1, r2);

        let r3 = &mut s; // 没问题
        println!("r3:{}", r3); 

        //编译器在作用域结束之前判断不再使用的引用的能力被称为非词法作用域生命周期
    }
}
